# Написать программу проверки, является ли строка палиндромом

word = input("Введите слово или число: ")
if str(word) == str(word)[::-1]:
    print("Палиндром")
else:
    print("Не палиндром")